<?php


/**
 * @操作信息
 * 
 * 
 */


/**
 * @appen接收提示信息
 * appen 输出提示
 */
return array(
    5000 => Plug_lang('无法接收到GET数据包'),
    5001 => Plug_lang('无法接收到POST数据包'),
    5002 => Plug_lang('数据包内出现系统屏蔽字符串'),
    5003 => Plug_lang('数据包已经过期拒绝接收,请校准本地时间与服务器时间一致。'),
    5004 => Plug_lang('接口不存在,连接失败'),
    5005 => Plug_lang('软件连接号错误,访问软件不存在'),
    5006 => Plug_lang('软件MD5验证失败'),
    5007 => Plug_lang('非法的请求,身份验证失败!'),
    5008 => Plug_lang('欢迎你首次使用!,请重新登陆.'),
    5009 => Plug_lang('绑定特征码,已经有人绑定过了,不能重复绑定,不能登陆'),
    5010 => Plug_lang('当前绑定特征已经有人绑定了'),
    5011 => Plug_lang('账号注册成功,当前机器特征已经有人绑定'),
    5012 => Plug_lang('当前特征已经有人绑定,无法再绑定'),
    5013 => Plug_lang('绑定成功!'),
    5014 => Plug_lang('绑定失败,请重试!'),
    5015 => Plug_lang('绑定特征不能为空'),
    5016 => Plug_lang('已经绑定了,不需要再绑定'),
    5017 => Plug_lang('使用软件不属于账号登陆限时/计点模式'),
    5018 => Plug_lang('当前卡串已经到期,无法解除绑定'),
    5019 => Plug_lang('解除绑定将到期,无法解除绑定'),
    5020 => Plug_lang('解除绑定失败,请重试或者联系相关人员解决'),
    5021 => Plug_lang('解除绑定成功,已经扣除对应时间'),
    5022 => Plug_lang('当前的卡串已经解除绑定,无须再解除绑定,请直接绑定就可以'),
    5023 => Plug_lang('绑定KEY不能为空'),
    5024 => Plug_lang('绑定成功!'),
    5025 => Plug_lang('绑定失败,当前卡串已经绑定key,必须解除绑定才能再绑定'),
    5026 => Plug_lang('账号登录超时,由于你长时间没有操作请种新登录'),
    5027 => Plug_lang('登录状态更新失败！'),
    5028 => Plug_lang('登录状态更新成功！'),
    5029 => Plug_lang('帐号没有到期！'),
    5030 => Plug_lang('登录帐号已经到期！'),
    5031 => Plug_lang('执行正常'),
    5032 => Plug_lang('扣点模式之扣点执行失败'),
    5033 => Plug_lang('用户已经到期,无法获取重要的验证数据'),
    5034 => Plug_lang('非绑定机器,如不需要验证绑定特征请设置'),
    5035 => Plug_lang('非绑定机器,请到绑定机器上使用'),
    5036 => Plug_lang('执行正常,当前扣点模式为：客户端扣点API调用被动'),
    5037 => Plug_lang('登录模式计点模式扣点执行正常'),
    5038 => Plug_lang('登录模式计点模式扣点执行失败'),
    5039 => Plug_lang('扣点点数不能小于或者等于0'),
    5040 => Plug_lang('模式不匹配,当前API只能在《登录计时模式》下使用'),
    5041 => Plug_lang('软件非扣点模式,API无法执行'),
    5042 => Plug_lang('使用软件不属于卡串计时/扣点模式'),
    5043 => Plug_lang('模式不匹配,当前API只能在《卡串计时模式》下使用'),
    5044 => Plug_lang('点数不足,无法扣除！'),
    5045 => Plug_lang('模式不匹配,当前API只能在《登录扣点模式》下使用'),
    5046 => Plug_lang('模式不匹配,当前API只能在《卡串扣点模式》下使用'),
    5047 => Plug_lang('登录限制验证通过,登录继续！'),
    5048 => Plug_lang('当前机器登陆在线量已经到达上限,如果已经退出其它软件请稍后再登录！'),
    5049 => Plug_lang('机器同时登录在线使用数量已经达到上限,如果已经退出其它软件请稍后再登录！'),
    5050 => Plug_lang('账号同时登录在线数量已经到上限,如果已经退出其它软件请稍后再登录！'),
    5051 => Plug_lang('机器标记没有不可空 CODE:63782'),
    5052 => Plug_lang('Sgin签名验证失败 CODE:63783'),
    5053 => Plug_lang('Sgin签名参数不能为空 CODE:63786'),
    5054 => Plug_lang('无法识别的通信方式 CODE:63784'),

    5055 => Plug_lang('当前激活码已经被冻结禁止登录当前软件'),
    5056 => Plug_lang('多开控制无法获取用户信息'),


    5057 => Plug_lang('模式不匹配,当前API只能在《账号登录限时模式》下使用,后台软件列表查看模式'),
    5058 => Plug_lang('模式不匹配,当前API只能在《卡串验证限时模式》下使用,后台软件列表查看模式'),

    5059 => Plug_lang('当前请求Sessl已经注销,请重新获取新的Sessl.')
);

