<?php


/**
 * @操作信息
 * 
 * 
 */
 
 
 
   /**
   * @错误信息
   * 所有会员操作函数所提示的信息
   * 提示从 1000开始
   */
	return array(
     1000 => Plug_Lang('用户已经存在。请选择其他!'),
     1001 => Plug_Lang('你选择用户名可以使用!'),
     1002 => Plug_Lang('2次密码输入不一致!'),
     1003 => Plug_Lang('账号长度错误限制 ').Plug_Get_Configs_Value('user','user_a').'-'.Plug_Get_Configs_Value('user','user_b').Plug_Lang('位数'),
     1004 =>  Plug_Get_Configs_Value('user','user_id_info'),
     1005 => Plug_Lang('恭喜你注册成功!'),
     1006 => Plug_Lang('账号注册失败,请联系管理员.'),
     1007 => Plug_Lang('密码长度限制 ').Plug_Get_Configs_Value('user','user_pwd_a').'-'.Plug_Get_Configs_Value('user','user_pwd_b').Plug_Lang('位数'),
     1008 => Plug_Lang('账号错误'),
     1009 => Plug_Lang('密码错误'),
     1010 => Plug_Lang('登陆账号不存在'),
     1011 => Plug_Lang('登陆成功'),
     1012 => Plug_Lang('密码错误'),
     1013 => Plug_Lang('登陆失败'),
     1014 => Plug_Lang('QQ号错误'),
     1015 => Plug_Lang('邮箱错误'),
     1016 => Plug_Lang('手机号码错误'),
     1017 => Plug_Lang('保存成功'),
     1018 => Plug_Lang('保存失败'),
     1019 => Plug_Lang('不能输入空格'),
     1020 => Plug_Lang('请输入密保问题或者答案'),
     1021 => Plug_Lang('账号已经被冻结禁止登陆'),
     1022 => Plug_Lang('记录查询失败'),
     1023 => Plug_Lang('你的密保信息已经填写'),
     1024 => Plug_Lang('密保信息添加成功'),
     1025 => Plug_Lang('密保添加失败'),
     1026 => Plug_Lang('密码不能包含空格'),
     1027 => Plug_Lang('请输入旧密码'),
     1028 => Plug_Lang('旧密码不能和新密码一致'),
     1029 => Plug_Lang('密码修改失败'),
     1030 => Plug_Lang('旧密码不正确,请重新输入'),
     1031 => Plug_Lang('密码修改成功'),
     1032 => Plug_Lang('表单信息不能为空,请返回填写'),
     1033 => Plug_Lang('密码已经成功通过密保信息修改'),
     1034 => Plug_Lang('密保信息错误'),
     1035 => Plug_Lang('密码找回失败'),
     1036 => Plug_Lang('验证码不能为空'),
     1037 => Plug_Lang('验证码正确'),
     1038 => Plug_Lang('验证码错误'),
     1039 => Plug_Lang('检测账号不能为空'),
     1040 => Plug_Lang('账号不能包含空格'),
     1041 => Plug_Lang('长时空闲超时执行正常'),
     1042 => Plug_Lang('长时空闲超时执行异常'),
     1043 => Plug_Lang('账号不存在'),
     1044 => Plug_Lang('账号已经被冻结禁止登陆'),
     1045 => Plug_Lang('登陆超时,由于你长时间不停留请重新登陆'),
     1046 => Plug_Lang('你在别处已经登陆,被迫登出！'),
     1047 => Plug_Lang('已经登陆'),
     1048 => Plug_Lang('你需要登陆才可以访问'),
     1049 => Plug_Lang('未登录,需要登录后再调用,请传递登录后的SeSsL串再继续操作.'),
     1050 => Plug_Lang('密保不能少于4字符'),
     1051 => Plug_Lang('密保信息未填写'),
     1052 => Plug_Lang('充值账号不能为空'),
     1053 => Plug_Lang('充值卡号不能为空'),
     1054 => Plug_Lang('充值卡密码不能为空'),
     1055 => Plug_Lang('充值账号不能包含空格'),
     1056 => Plug_Lang('充值卡号不能包含空格'),
     1057 => Plug_Lang('充值卡密码不能包含空格'),
     1058 => Plug_Lang('充值卡号或充值卡密码错误'),
     1059 => Plug_Lang('充值的用户账号不存在'),
     1060 => Plug_Lang('充值卡账号密码错误或者不存在'),
     1061 => Plug_Lang('用户没有使用过要充值软件,拒绝充值'),
     1062 => Plug_Lang('激活成功,赶快去使用吧!'),
     1063 => Plug_Lang('充值失败!'),
     1064 => Plug_Lang('充值卡已经充值过了'),
     1065 => Plug_Lang('你留言和反馈我们已经收到,谢谢你的支持'),
     1066 => Plug_Lang('提交留言失败'),
     1067 => Plug_Lang('请输入标题'),
     1068 => Plug_Lang('请输入留言内容'),
     1069 => Plug_Lang('激活成功,请再次验证就可以使用了！'),
     1070 => Plug_Lang('添加失败'),
     1071 => Plug_Lang('糟糕激活码已经存在了'),
     1072 => Plug_Lang('还没有存在'),
     1073 => Plug_Lang('激活码不存在'),
     1074 => Plug_Lang('你使用激活串已到期作废！'),
     1075 => Plug_Lang('激活码已经存在,无法激活'),
     1076 => Plug_Lang('car执行错误'),
     1077 => Plug_Lang('请检查激活码号或者密码错误！'),
     1078 => Plug_Lang('你使用权已经被冻结,无法验证！'),
     1079 => Plug_Lang('验证失败请确认已经输入激活码/或已经验证使用'),
     1080 => Plug_Lang('验证成功'),
     1081 => Plug_Lang('登录验证成功！'),
     1082 => Plug_Lang('你的使用期已到,请购卡再使用'),
     1083 => Plug_Lang('没有查询到用户信息'),
     1084 => Plug_Lang('该用户不是使用本软件的'),
     1085 => Plug_Lang('用户已经被冻结'),
     1086 => Plug_Lang('激活码或者验证串已经被冻结,无法继续。'),
     1087 => Plug_Lang('帐号已经到期请充值再使用。'),
     1088 => Plug_Lang('请输入一个邮箱作为你的帐号'),  
     1089 => Plug_Lang('恭喜你注册成功,赶快去你邮箱把你帐号激活吧!'),
     1090 => Plug_Lang('密保邮箱不能为空!'),
     1091 => Plug_Lang('密保邮箱格式不正确,请重新输入!'),
     1092 => Plug_Lang('QQ号不能为空!'),
     1093 => Plug_Lang('QQ号格式输入不正确,请重新输入!'),
     1094 => Plug_Lang('你的帐号还没激活,现在已经有一封激活邮件发到你注册邮箱上,赶快去激活吧！!'),
     1095 => Plug_Lang('请输入你联系访方式 QQ:1234556 邮箱:XXX@qq.com 电话:15288888888!'),
     1096 => Plug_Lang('账号余额不足,无法继续。'),
     1097 => Plug_Lang('账号余额不足,请充值再继续。'),
     1098 => Plug_Lang('执行扣点成功。'),
     1099 => Plug_Lang('执行扣点失败。'),
     1100 => Plug_Lang('扣除金额不能为零或小于零。'),
     1101 => Plug_Lang('记录日志标题不可为空。'),
     // 1101 => Plug_Lang('账号扣点为Bsphp验证商业功能才扣除,需要使用请选开启VIP用户权限 地址:http://management.bsphp.com'),
	 1102 => Plug_Lang('尊敬用户你非Bsphp商业用户你用户数已经达最大限制,如果你要继续让更都用户使用注册请先开通商业用户资格 地址:http://www.bsphp.com'),
     1103 => Plug_Lang('账号格式错误,只能选择中+下滑线'),
     1104 => Plug_Lang('账号格式错误,只能选择字母+数字和_下滑线'),
     1105 => Plug_Lang('当前账号包含禁止关键字,请更换其他！'),
     1106 => Plug_Lang('手机号码不能为空,请输入手机号码！'),
     1107 => Plug_Lang('账号注册成功！'),
     1108 => Plug_Lang('账号注册成功！'),
     1109 => Plug_Lang('找回的账号错误,请正确输入需要找回账号！'),
     1110 => Plug_Lang('系统已经关闭账号注册,暂时无法注册！'),
     1111 => Plug_Lang('注册账号过于频繁请稍后再试'),
     1112 => Plug_Lang('充值失败,当前充值卡只可以充值已经到期账号,谢谢你使用,请到期后再充值'),
     1113 => Plug_Lang('当前激活码不属于当前软件使用,请选择对应软件使用！'),
     1114 => Plug_Lang('模式不符合,请选择对应软件使用！'),
     
     1115 => Plug_Lang('激活码不能为空！'),
     1116 => Plug_Lang('注销成功!'),
     1117 => Plug_Lang('注销失败!'),
     1118 => Plug_Lang('代理商账号只可以登录代理平台!'),
     1119 => Plug_Lang('接口调用失败,非指定模式不可调用,请在对应软件模式下调用对应接口'),
     1120 => Plug_Lang('当前账号禁止修改密码'),
     1121 => Plug_Lang('用户关联账户不存在'),
     1122 => Plug_Lang('激活成功'),
     
	 
	 
	 1123 => Plug_Lang('激活邮件已经发送到您注册时填写邮箱,请前往邮箱激活账号再登录.'),
	 1124 => Plug_Lang('邮件发送失败.'),
	 1125 => Plug_Lang('注册账号已经锁定,需要管理人审核才可使用.'),
	 
	 1126 => Plug_Lang('重置密码邮件已经发出.'),
	 1127 => Plug_Lang('当前邮箱已经注册过，可直接用邮箱登录.'),
     
     1128 => Plug_Lang('邀请人不存在/没有可不填写'),
     1129 => Plug_Lang('邀请人不能为空,必须有邀请人才可注册'),
     1130 => Plug_Lang('邀请人不能为空,请输邀请人'),
     1131 => Plug_Lang('[系统授权提示]系统超出授权用户数量最大限制'),
     1132 => Plug_Lang('充值账号已经被冻结，无法充值请重新注册再充值'),
     1133 => Plug_Lang('找回密码账户不存在'),
     1134 => Plug_Lang('找回密码账户没有绑定邮箱'),
     1135 => Plug_Lang('无法检索到您激活码信息有误'),
     1136 => Plug_Lang('请到对应软件下使用'),
     1137 => Plug_Lang('检测到充值/激活码是<[软件]>软件的,请到对应软件下使用并充值!'),
     1138 => Plug_Lang('输入的激活码/充值卡不存在,请正确输入'),
     1139 => Plug_Lang('输入的激活码卡模式激活码,使用chong.ic接口充值'),
     1140 => Plug_Lang('输入的充值卡为登陆模式软件使用,使用chong.lg接口充值'),
     1141 => Plug_Lang('充值卡不存在，请检查是否输入正确'),

     1142 => Plug_Lang('当前手机号已经注册过，可直接用手机登录'),
     );
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
     
?>